/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]

pub const _SYS_TYPES_H: u32 = 1;
pub const __BIT_TYPES_DEFINED__: u32 = 1;
pub const _ENDIAN_H: u32 = 1;
pub const LITTLE_ENDIAN: u32 = 1234;
pub const BIG_ENDIAN: u32 = 4321;
pub const PDP_ENDIAN: u32 = 3412;
pub const BYTE_ORDER: u32 = 1234;
pub const _BITS_BYTESWAP_H: u32 = 1;
pub const _BITS_UINTN_IDENTITY_H: u32 = 1;
pub const _SYS_SELECT_H: u32 = 1;
pub const __sigset_t_defined: u32 = 1;
pub const __timeval_defined: u32 = 1;
pub const FD_SETSIZE: u32 = 1024;
pub const IB_USER_VERBS_ABI_VERSION: u32 = 6;
pub const IB_USER_VERBS_CMD_THRESHOLD: u32 = 50;
pub const IB_USER_VERBS_CMD_COMMAND_MASK: u32 = 255;
pub const IB_USER_VERBS_CMD_FLAG_EXTENDED: u32 = 2147483648;
pub const IB_USER_VERBS_MAX_LOG_IND_TBL_SIZE: u32 = 13;
pub const IB_DEVICE_NAME_MAX: u32 = 64;
pub const IB_UVERBS_ACCESS_OPTIONAL_FIRST: u32 = 1048576;
pub const IB_UVERBS_ACCESS_OPTIONAL_LAST: u32 = 536870912;
pub const IBV_ACCESS_OPTIONAL_FIRST: u32 = 1048576;
pub const IBV_DEVICE_RAW_SCATTER_FCS: u64 = 17179869184;
pub const IBV_DEVICE_PCI_WRITE_END_PADDING: u64 = 68719476736;
pub const ETHERNET_LL_SIZE: u32 = 6;
pub const IB_ROCE_UDP_ENCAP_VALID_PORT_MIN: u32 = 49152;
pub const IB_ROCE_UDP_ENCAP_VALID_PORT_MAX: u32 = 65535;
pub const IB_GRH_FLOWLABEL_MASK: u32 = 1048575;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type pid_t = __pid_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sched_param() {
    assert_eq!(
        ::std::mem::size_of::<sched_param>(),
        4usize,
        concat!("Size of: ", stringify!(sched_param))
    );
    assert_eq!(
        ::std::mem::align_of::<sched_param>(),
        4usize,
        concat!("Alignment of ", stringify!(sched_param))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sched_param>())).sched_priority as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sched_param),
            "::",
            stringify!(sched_priority)
        )
    );
}
pub type __cpu_mask = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 16usize],
}
#[test]
fn bindgen_test_layout_cpu_set_t() {
    assert_eq!(
        ::std::mem::size_of::<cpu_set_t>(),
        128usize,
        concat!("Size of: ", stringify!(cpu_set_t))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_set_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_set_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_set_t>())).__bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_set_t),
            "::",
            stringify!(__bits)
        )
    );
}
extern "C" {
    pub fn __sched_cpucount(__setsize: usize, __setp: *const cpu_set_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __sched_cpualloc(__count: usize) -> *mut cpu_set_t;
}
extern "C" {
    pub fn __sched_cpufree(__set: *mut cpu_set_t);
}
extern "C" {
    pub fn sched_setparam(__pid: __pid_t, __param: *const sched_param) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_getparam(__pid: __pid_t, __param: *mut sched_param) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_setscheduler(
        __pid: __pid_t,
        __policy: ::std::os::raw::c_int,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_getscheduler(__pid: __pid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_yield() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_get_priority_max(__algorithm: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_get_priority_min(__algorithm: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_rr_get_interval(__pid: __pid_t, __t: *mut timespec) -> ::std::os::raw::c_int;
}
pub type clock_t = __clock_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_gmtoff as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_zone as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
impl Default for tm {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
impl Default for __locale_struct {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__atomic_wide_counter__bindgen_ty_1>())).__low as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__atomic_wide_counter__bindgen_ty_1>())).__high as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__atomic_wide_counter>())).__value64 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__atomic_wide_counter>())).__value32 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
impl Default for __atomic_wide_counter {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
impl Default for __pthread_internal_list {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
impl Default for __pthread_internal_slist {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
impl Default for __pthread_mutex_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wseq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_start as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
impl Default for __pthread_cond_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__once_flag>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_mutexattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_condattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_attr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_mutex_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_cond_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_rwlock_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_rwlockattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_barrier_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_barrierattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __jmp_buf = [::std::os::raw::c_long; 8usize];
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __jmp_buf_tag {
    pub __jmpbuf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
    pub __saved_mask: __sigset_t,
}
#[test]
fn bindgen_test_layout___jmp_buf_tag() {
    assert_eq!(
        ::std::mem::size_of::<__jmp_buf_tag>(),
        200usize,
        concat!("Size of: ", stringify!(__jmp_buf_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__jmp_buf_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__jmp_buf_tag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__jmpbuf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__jmpbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__mask_was_saved as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__mask_was_saved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__saved_mask as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__saved_mask)
        )
    );
}
pub const PTHREAD_CREATE_JOINABLE: _bindgen_ty_1 = 0;
pub const PTHREAD_CREATE_DETACHED: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = u32;
pub const PTHREAD_MUTEX_TIMED_NP: _bindgen_ty_2 = 0;
pub const PTHREAD_MUTEX_RECURSIVE_NP: _bindgen_ty_2 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK_NP: _bindgen_ty_2 = 2;
pub const PTHREAD_MUTEX_ADAPTIVE_NP: _bindgen_ty_2 = 3;
pub const PTHREAD_MUTEX_NORMAL: _bindgen_ty_2 = 0;
pub const PTHREAD_MUTEX_RECURSIVE: _bindgen_ty_2 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK: _bindgen_ty_2 = 2;
pub const PTHREAD_MUTEX_DEFAULT: _bindgen_ty_2 = 0;
pub type _bindgen_ty_2 = u32;
pub const PTHREAD_MUTEX_STALLED: _bindgen_ty_3 = 0;
pub const PTHREAD_MUTEX_STALLED_NP: _bindgen_ty_3 = 0;
pub const PTHREAD_MUTEX_ROBUST: _bindgen_ty_3 = 1;
pub const PTHREAD_MUTEX_ROBUST_NP: _bindgen_ty_3 = 1;
pub type _bindgen_ty_3 = u32;
pub const PTHREAD_PRIO_NONE: _bindgen_ty_4 = 0;
pub const PTHREAD_PRIO_INHERIT: _bindgen_ty_4 = 1;
pub const PTHREAD_PRIO_PROTECT: _bindgen_ty_4 = 2;
pub type _bindgen_ty_4 = u32;
pub const PTHREAD_RWLOCK_PREFER_READER_NP: _bindgen_ty_5 = 0;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NP: _bindgen_ty_5 = 1;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP: _bindgen_ty_5 = 2;
pub const PTHREAD_RWLOCK_DEFAULT_NP: _bindgen_ty_5 = 0;
pub type _bindgen_ty_5 = u32;
pub const PTHREAD_INHERIT_SCHED: _bindgen_ty_6 = 0;
pub const PTHREAD_EXPLICIT_SCHED: _bindgen_ty_6 = 1;
pub type _bindgen_ty_6 = u32;
pub const PTHREAD_SCOPE_SYSTEM: _bindgen_ty_7 = 0;
pub const PTHREAD_SCOPE_PROCESS: _bindgen_ty_7 = 1;
pub type _bindgen_ty_7 = u32;
pub const PTHREAD_PROCESS_PRIVATE: _bindgen_ty_8 = 0;
pub const PTHREAD_PROCESS_SHARED: _bindgen_ty_8 = 1;
pub type _bindgen_ty_8 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_cleanup_buffer {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __canceltype: ::std::os::raw::c_int,
    pub __prev: *mut _pthread_cleanup_buffer,
}
#[test]
fn bindgen_test_layout__pthread_cleanup_buffer() {
    assert_eq!(
        ::std::mem::size_of::<_pthread_cleanup_buffer>(),
        32usize,
        concat!("Size of: ", stringify!(_pthread_cleanup_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<_pthread_cleanup_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(_pthread_cleanup_buffer))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_pthread_cleanup_buffer>())).__routine as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_pthread_cleanup_buffer>())).__arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_pthread_cleanup_buffer>())).__canceltype as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__canceltype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_pthread_cleanup_buffer>())).__prev as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__prev)
        )
    );
}
impl Default for _pthread_cleanup_buffer {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub const PTHREAD_CANCEL_ENABLE: _bindgen_ty_9 = 0;
pub const PTHREAD_CANCEL_DISABLE: _bindgen_ty_9 = 1;
pub type _bindgen_ty_9 = u32;
pub const PTHREAD_CANCEL_DEFERRED: _bindgen_ty_10 = 0;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: _bindgen_ty_10 = 1;
pub type _bindgen_ty_10 = u32;
extern "C" {
    pub fn pthread_create(
        __newthread: *mut pthread_t,
        __attr: *const pthread_attr_t,
        __start_routine: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_exit(__retval: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn pthread_join(
        __th: pthread_t,
        __thread_return: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_detach(__th: pthread_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_self() -> pthread_t;
}
extern "C" {
    pub fn pthread_equal(__thread1: pthread_t, __thread2: pthread_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_init(__attr: *mut pthread_attr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_destroy(__attr: *mut pthread_attr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getdetachstate(
        __attr: *const pthread_attr_t,
        __detachstate: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setdetachstate(
        __attr: *mut pthread_attr_t,
        __detachstate: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getguardsize(
        __attr: *const pthread_attr_t,
        __guardsize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setguardsize(
        __attr: *mut pthread_attr_t,
        __guardsize: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedparam(
        __attr: *const pthread_attr_t,
        __param: *mut sched_param,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedparam(
        __attr: *mut pthread_attr_t,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedpolicy(
        __attr: *const pthread_attr_t,
        __policy: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedpolicy(
        __attr: *mut pthread_attr_t,
        __policy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getinheritsched(
        __attr: *const pthread_attr_t,
        __inherit: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setinheritsched(
        __attr: *mut pthread_attr_t,
        __inherit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getscope(
        __attr: *const pthread_attr_t,
        __scope: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setscope(
        __attr: *mut pthread_attr_t,
        __scope: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getstackaddr(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setstackaddr(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getstacksize(
        __attr: *const pthread_attr_t,
        __stacksize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setstacksize(
        __attr: *mut pthread_attr_t,
        __stacksize: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getstack(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut ::std::os::raw::c_void,
        __stacksize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setstack(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut ::std::os::raw::c_void,
        __stacksize: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setschedparam(
        __target_thread: pthread_t,
        __policy: ::std::os::raw::c_int,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_getschedparam(
        __target_thread: pthread_t,
        __policy: *mut ::std::os::raw::c_int,
        __param: *mut sched_param,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setschedprio(
        __target_thread: pthread_t,
        __prio: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_once(
        __once_control: *mut pthread_once_t,
        __init_routine: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setcancelstate(
        __state: ::std::os::raw::c_int,
        __oldstate: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setcanceltype(
        __type: ::std::os::raw::c_int,
        __oldtype: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cancel(__th: pthread_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_testcancel();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __cancel_jmp_buf_tag {
    pub __cancel_jmp_buf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___cancel_jmp_buf_tag() {
    assert_eq!(
        ::std::mem::size_of::<__cancel_jmp_buf_tag>(),
        72usize,
        concat!("Size of: ", stringify!(__cancel_jmp_buf_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__cancel_jmp_buf_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__cancel_jmp_buf_tag))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__cancel_jmp_buf_tag>())).__cancel_jmp_buf as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__cancel_jmp_buf_tag),
            "::",
            stringify!(__cancel_jmp_buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__cancel_jmp_buf_tag>())).__mask_was_saved as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__cancel_jmp_buf_tag),
            "::",
            stringify!(__mask_was_saved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_unwind_buf_t {
    pub __cancel_jmp_buf: [__cancel_jmp_buf_tag; 1usize],
    pub __pad: [*mut ::std::os::raw::c_void; 4usize],
}
#[test]
fn bindgen_test_layout___pthread_unwind_buf_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_unwind_buf_t>(),
        104usize,
        concat!("Size of: ", stringify!(__pthread_unwind_buf_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_unwind_buf_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_unwind_buf_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_unwind_buf_t>())).__cancel_jmp_buf as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t),
            "::",
            stringify!(__cancel_jmp_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_unwind_buf_t>())).__pad as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t),
            "::",
            stringify!(__pad)
        )
    );
}
impl Default for __pthread_unwind_buf_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cleanup_frame {
    pub __cancel_routine:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __cancel_arg: *mut ::std::os::raw::c_void,
    pub __do_it: ::std::os::raw::c_int,
    pub __cancel_type: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___pthread_cleanup_frame() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cleanup_frame>(),
        24usize,
        concat!("Size of: ", stringify!(__pthread_cleanup_frame))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cleanup_frame>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cleanup_frame))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cleanup_frame>())).__cancel_routine as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_routine)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cleanup_frame>())).__cancel_arg as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cleanup_frame>())).__do_it as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__do_it)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cleanup_frame>())).__cancel_type as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_type)
        )
    );
}
impl Default for __pthread_cleanup_frame {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn __pthread_register_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unregister_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unwind_next(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __sigsetjmp(
        __env: *mut __jmp_buf_tag,
        __savemask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_init(
        __mutex: *mut pthread_mutex_t,
        __mutexattr: *const pthread_mutexattr_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_destroy(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_trylock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_lock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_timedlock(
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_unlock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_getprioceiling(
        __mutex: *const pthread_mutex_t,
        __prioceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_setprioceiling(
        __mutex: *mut pthread_mutex_t,
        __prioceiling: ::std::os::raw::c_int,
        __old_ceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_consistent(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_init(__attr: *mut pthread_mutexattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_destroy(__attr: *mut pthread_mutexattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getpshared(
        __attr: *const pthread_mutexattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setpshared(
        __attr: *mut pthread_mutexattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_gettype(
        __attr: *const pthread_mutexattr_t,
        __kind: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_settype(
        __attr: *mut pthread_mutexattr_t,
        __kind: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getprotocol(
        __attr: *const pthread_mutexattr_t,
        __protocol: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setprotocol(
        __attr: *mut pthread_mutexattr_t,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getprioceiling(
        __attr: *const pthread_mutexattr_t,
        __prioceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setprioceiling(
        __attr: *mut pthread_mutexattr_t,
        __prioceiling: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getrobust(
        __attr: *const pthread_mutexattr_t,
        __robustness: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setrobust(
        __attr: *mut pthread_mutexattr_t,
        __robustness: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_init(
        __rwlock: *mut pthread_rwlock_t,
        __attr: *const pthread_rwlockattr_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_destroy(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_rdlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_tryrdlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_timedrdlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_wrlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_trywrlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_timedwrlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_unlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_init(__attr: *mut pthread_rwlockattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_destroy(__attr: *mut pthread_rwlockattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_getpshared(
        __attr: *const pthread_rwlockattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_setpshared(
        __attr: *mut pthread_rwlockattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_getkind_np(
        __attr: *const pthread_rwlockattr_t,
        __pref: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_setkind_np(
        __attr: *mut pthread_rwlockattr_t,
        __pref: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_init(
        __cond: *mut pthread_cond_t,
        __cond_attr: *const pthread_condattr_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_destroy(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_signal(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_broadcast(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_wait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_timedwait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_condattr_init(__attr: *mut pthread_condattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_condattr_destroy(__attr: *mut pthread_condattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_condattr_getpshared(
        __attr: *const pthread_condattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_condattr_setpshared(
        __attr: *mut pthread_condattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_condattr_getclock(
        __attr: *const pthread_condattr_t,
        __clock_id: *mut __clockid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_condattr_setclock(
        __attr: *mut pthread_condattr_t,
        __clock_id: __clockid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_spin_init(
        __lock: *mut pthread_spinlock_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_spin_destroy(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_spin_lock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_spin_trylock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_spin_unlock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_barrier_init(
        __barrier: *mut pthread_barrier_t,
        __attr: *const pthread_barrierattr_t,
        __count: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_barrier_destroy(__barrier: *mut pthread_barrier_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_barrier_wait(__barrier: *mut pthread_barrier_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_init(__attr: *mut pthread_barrierattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_destroy(__attr: *mut pthread_barrierattr_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_getpshared(
        __attr: *const pthread_barrierattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_setpshared(
        __attr: *mut pthread_barrierattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_key_create(
        __key: *mut pthread_key_t,
        __destr_function: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void),
        >,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_key_delete(__key: pthread_key_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_getspecific(__key: pthread_key_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pthread_setspecific(
        __key: pthread_key_t,
        __pointer: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_getcpuclockid(
        __thread_id: pthread_t,
        __clock_id: *mut __clockid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_atfork(
        __prepare: ::std::option::Option<unsafe extern "C" fn()>,
        __parent: ::std::option::Option<unsafe extern "C" fn()>,
        __child: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Default, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
extern "C" {
    pub fn __errno_location() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: usize,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___kernel_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<__kernel_fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__kernel_fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___kernel_fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__kernel_fsid_t>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub const IB_USER_VERBS_CMD_GET_CONTEXT: ib_uverbs_write_cmds = 0;
pub const IB_USER_VERBS_CMD_QUERY_DEVICE: ib_uverbs_write_cmds = 1;
pub const IB_USER_VERBS_CMD_QUERY_PORT: ib_uverbs_write_cmds = 2;
pub const IB_USER_VERBS_CMD_ALLOC_PD: ib_uverbs_write_cmds = 3;
pub const IB_USER_VERBS_CMD_DEALLOC_PD: ib_uverbs_write_cmds = 4;
pub const IB_USER_VERBS_CMD_CREATE_AH: ib_uverbs_write_cmds = 5;
pub const IB_USER_VERBS_CMD_MODIFY_AH: ib_uverbs_write_cmds = 6;
pub const IB_USER_VERBS_CMD_QUERY_AH: ib_uverbs_write_cmds = 7;
pub const IB_USER_VERBS_CMD_DESTROY_AH: ib_uverbs_write_cmds = 8;
pub const IB_USER_VERBS_CMD_REG_MR: ib_uverbs_write_cmds = 9;
pub const IB_USER_VERBS_CMD_REG_SMR: ib_uverbs_write_cmds = 10;
pub const IB_USER_VERBS_CMD_REREG_MR: ib_uverbs_write_cmds = 11;
pub const IB_USER_VERBS_CMD_QUERY_MR: ib_uverbs_write_cmds = 12;
pub const IB_USER_VERBS_CMD_DEREG_MR: ib_uverbs_write_cmds = 13;
pub const IB_USER_VERBS_CMD_ALLOC_MW: ib_uverbs_write_cmds = 14;
pub const IB_USER_VERBS_CMD_BIND_MW: ib_uverbs_write_cmds = 15;
pub const IB_USER_VERBS_CMD_DEALLOC_MW: ib_uverbs_write_cmds = 16;
pub const IB_USER_VERBS_CMD_CREATE_COMP_CHANNEL: ib_uverbs_write_cmds = 17;
pub const IB_USER_VERBS_CMD_CREATE_CQ: ib_uverbs_write_cmds = 18;
pub const IB_USER_VERBS_CMD_RESIZE_CQ: ib_uverbs_write_cmds = 19;
pub const IB_USER_VERBS_CMD_DESTROY_CQ: ib_uverbs_write_cmds = 20;
pub const IB_USER_VERBS_CMD_POLL_CQ: ib_uverbs_write_cmds = 21;
pub const IB_USER_VERBS_CMD_PEEK_CQ: ib_uverbs_write_cmds = 22;
pub const IB_USER_VERBS_CMD_REQ_NOTIFY_CQ: ib_uverbs_write_cmds = 23;
pub const IB_USER_VERBS_CMD_CREATE_QP: ib_uverbs_write_cmds = 24;
pub const IB_USER_VERBS_CMD_QUERY_QP: ib_uverbs_write_cmds = 25;
pub const IB_USER_VERBS_CMD_MODIFY_QP: ib_uverbs_write_cmds = 26;
pub const IB_USER_VERBS_CMD_DESTROY_QP: ib_uverbs_write_cmds = 27;
pub const IB_USER_VERBS_CMD_POST_SEND: ib_uverbs_write_cmds = 28;
pub const IB_USER_VERBS_CMD_POST_RECV: ib_uverbs_write_cmds = 29;
pub const IB_USER_VERBS_CMD_ATTACH_MCAST: ib_uverbs_write_cmds = 30;
pub const IB_USER_VERBS_CMD_DETACH_MCAST: ib_uverbs_write_cmds = 31;
pub const IB_USER_VERBS_CMD_CREATE_SRQ: ib_uverbs_write_cmds = 32;
pub const IB_USER_VERBS_CMD_MODIFY_SRQ: ib_uverbs_write_cmds = 33;
pub const IB_USER_VERBS_CMD_QUERY_SRQ: ib_uverbs_write_cmds = 34;
pub const IB_USER_VERBS_CMD_DESTROY_SRQ: ib_uverbs_write_cmds = 35;
pub const IB_USER_VERBS_CMD_POST_SRQ_RECV: ib_uverbs_write_cmds = 36;
pub const IB_USER_VERBS_CMD_OPEN_XRCD: ib_uverbs_write_cmds = 37;
pub const IB_USER_VERBS_CMD_CLOSE_XRCD: ib_uverbs_write_cmds = 38;
pub const IB_USER_VERBS_CMD_CREATE_XSRQ: ib_uverbs_write_cmds = 39;
pub const IB_USER_VERBS_CMD_OPEN_QP: ib_uverbs_write_cmds = 40;
pub type ib_uverbs_write_cmds = u32;
pub const IB_USER_VERBS_EX_CMD_QUERY_DEVICE: _bindgen_ty_11 = 1;
pub const IB_USER_VERBS_EX_CMD_CREATE_CQ: _bindgen_ty_11 = 18;
pub const IB_USER_VERBS_EX_CMD_CREATE_QP: _bindgen_ty_11 = 24;
pub const IB_USER_VERBS_EX_CMD_MODIFY_QP: _bindgen_ty_11 = 26;
pub const IB_USER_VERBS_EX_CMD_CREATE_FLOW: _bindgen_ty_11 = 50;
pub const IB_USER_VERBS_EX_CMD_DESTROY_FLOW: _bindgen_ty_11 = 51;
pub const IB_USER_VERBS_EX_CMD_CREATE_WQ: _bindgen_ty_11 = 52;
pub const IB_USER_VERBS_EX_CMD_MODIFY_WQ: _bindgen_ty_11 = 53;
pub const IB_USER_VERBS_EX_CMD_DESTROY_WQ: _bindgen_ty_11 = 54;
pub const IB_USER_VERBS_EX_CMD_CREATE_RWQ_IND_TBL: _bindgen_ty_11 = 55;
pub const IB_USER_VERBS_EX_CMD_DESTROY_RWQ_IND_TBL: _bindgen_ty_11 = 56;
pub const IB_USER_VERBS_EX_CMD_MODIFY_CQ: _bindgen_ty_11 = 57;
pub type _bindgen_ty_11 = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_async_event_desc {
    pub element: __u64,
    pub event_type: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_async_event_desc() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_async_event_desc>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_async_event_desc))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_async_event_desc>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_async_event_desc))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_async_event_desc>())).element as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_async_event_desc),
            "::",
            stringify!(element)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_async_event_desc>())).event_type as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_async_event_desc),
            "::",
            stringify!(event_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_async_event_desc>())).reserved as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_async_event_desc),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_comp_event_desc {
    pub cq_handle: __u64,
}
#[test]
fn bindgen_test_layout_ib_uverbs_comp_event_desc() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_comp_event_desc>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_comp_event_desc))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_comp_event_desc>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_comp_event_desc))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_comp_event_desc>())).cq_handle as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_comp_event_desc),
            "::",
            stringify!(cq_handle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_cq_moderation_caps {
    pub max_cq_moderation_count: __u16,
    pub max_cq_moderation_period: __u16,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_cq_moderation_caps() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_cq_moderation_caps>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_cq_moderation_caps))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_cq_moderation_caps>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_cq_moderation_caps))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_cq_moderation_caps>())).max_cq_moderation_count
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_cq_moderation_caps),
            "::",
            stringify!(max_cq_moderation_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_cq_moderation_caps>())).max_cq_moderation_period
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_cq_moderation_caps),
            "::",
            stringify!(max_cq_moderation_period)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_cq_moderation_caps>())).reserved as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_cq_moderation_caps),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_cmd_hdr {
    pub command: __u32,
    pub in_words: __u16,
    pub out_words: __u16,
}
#[test]
fn bindgen_test_layout_ib_uverbs_cmd_hdr() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_cmd_hdr>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_cmd_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_cmd_hdr>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_cmd_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_cmd_hdr>())).command as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_cmd_hdr),
            "::",
            stringify!(command)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_cmd_hdr>())).in_words as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_cmd_hdr),
            "::",
            stringify!(in_words)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_cmd_hdr>())).out_words as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_cmd_hdr),
            "::",
            stringify!(out_words)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_cmd_hdr {
    pub response: __u64,
    pub provider_in_words: __u16,
    pub provider_out_words: __u16,
    pub cmd_hdr_reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_ex_cmd_hdr() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_ex_cmd_hdr>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_ex_cmd_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_ex_cmd_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_ex_cmd_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ex_cmd_hdr>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_cmd_hdr),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_cmd_hdr>())).provider_in_words as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_cmd_hdr),
            "::",
            stringify!(provider_in_words)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_cmd_hdr>())).provider_out_words as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_cmd_hdr),
            "::",
            stringify!(provider_out_words)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_cmd_hdr>())).cmd_hdr_reserved as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_cmd_hdr),
            "::",
            stringify!(cmd_hdr_reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_get_context {
    pub response: __u64,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_get_context() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_get_context>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_get_context))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_get_context>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_get_context))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_get_context>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_get_context),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_get_context>())).driver_data as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_get_context),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_get_context_resp {
    pub async_fd: __u32,
    pub num_comp_vectors: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_get_context_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_get_context_resp>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_get_context_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_get_context_resp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_get_context_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_get_context_resp>())).async_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_get_context_resp),
            "::",
            stringify!(async_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_get_context_resp>())).num_comp_vectors as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_get_context_resp),
            "::",
            stringify!(num_comp_vectors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_get_context_resp>())).driver_data as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_get_context_resp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_query_device {
    pub response: __u64,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_query_device() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_query_device>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_query_device))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_query_device>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_query_device))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_device>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device>())).driver_data as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_query_device_resp {
    pub fw_ver: __u64,
    pub node_guid: __be64,
    pub sys_image_guid: __be64,
    pub max_mr_size: __u64,
    pub page_size_cap: __u64,
    pub vendor_id: __u32,
    pub vendor_part_id: __u32,
    pub hw_ver: __u32,
    pub max_qp: __u32,
    pub max_qp_wr: __u32,
    pub device_cap_flags: __u32,
    pub max_sge: __u32,
    pub max_sge_rd: __u32,
    pub max_cq: __u32,
    pub max_cqe: __u32,
    pub max_mr: __u32,
    pub max_pd: __u32,
    pub max_qp_rd_atom: __u32,
    pub max_ee_rd_atom: __u32,
    pub max_res_rd_atom: __u32,
    pub max_qp_init_rd_atom: __u32,
    pub max_ee_init_rd_atom: __u32,
    pub atomic_cap: __u32,
    pub max_ee: __u32,
    pub max_rdd: __u32,
    pub max_mw: __u32,
    pub max_raw_ipv6_qp: __u32,
    pub max_raw_ethy_qp: __u32,
    pub max_mcast_grp: __u32,
    pub max_mcast_qp_attach: __u32,
    pub max_total_mcast_qp_attach: __u32,
    pub max_ah: __u32,
    pub max_fmr: __u32,
    pub max_map_per_fmr: __u32,
    pub max_srq: __u32,
    pub max_srq_wr: __u32,
    pub max_srq_sge: __u32,
    pub max_pkeys: __u16,
    pub local_ca_ack_delay: __u8,
    pub phys_port_cnt: __u8,
    pub reserved: [__u8; 4usize],
}
#[test]
fn bindgen_test_layout_ib_uverbs_query_device_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_query_device_resp>(),
        176usize,
        concat!("Size of: ", stringify!(ib_uverbs_query_device_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_query_device_resp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_query_device_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).fw_ver as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(fw_ver)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).node_guid as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(node_guid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).sys_image_guid as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(sys_image_guid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_mr_size as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_mr_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).page_size_cap as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(page_size_cap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).vendor_id as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(vendor_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).vendor_part_id as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(vendor_part_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).hw_ver as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(hw_ver)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_qp as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_qp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_qp_wr as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_qp_wr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).device_cap_flags as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(device_cap_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_sge as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_sge)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_sge_rd as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_sge_rd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_cq as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_cq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_cqe as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_cqe)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_mr as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_mr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_pd as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_pd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_qp_rd_atom as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_qp_rd_atom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_ee_rd_atom as *const _
                as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_ee_rd_atom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_res_rd_atom as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_res_rd_atom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_qp_init_rd_atom as *const _
                as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_qp_init_rd_atom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_ee_init_rd_atom as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_ee_init_rd_atom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).atomic_cap as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(atomic_cap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_ee as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_ee)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_rdd as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_rdd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_mw as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_mw)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_raw_ipv6_qp as *const _
                as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_raw_ipv6_qp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_raw_ethy_qp as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_raw_ethy_qp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_mcast_grp as *const _
                as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_mcast_grp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_mcast_qp_attach as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_mcast_qp_attach)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_total_mcast_qp_attach
                as *const _ as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_total_mcast_qp_attach)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_ah as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_ah)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_fmr as *const _ as usize
        },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_fmr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_map_per_fmr as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_map_per_fmr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_srq as *const _ as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_srq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_srq_wr as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_srq_wr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_srq_sge as *const _ as usize
        },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_srq_sge)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).max_pkeys as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(max_pkeys)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).local_ca_ack_delay as *const _
                as usize
        },
        170usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(local_ca_ack_delay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).phys_port_cnt as *const _
                as usize
        },
        171usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(phys_port_cnt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_device_resp>())).reserved as *const _ as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_device_resp),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_query_device {
    pub comp_mask: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_ex_query_device() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_ex_query_device>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_ex_query_device))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_ex_query_device>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_ex_query_device))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device>())).comp_mask as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device),
            "::",
            stringify!(comp_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device>())).reserved as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_odp_caps {
    pub general_caps: __u64,
    pub per_transport_caps: ib_uverbs_odp_caps__bindgen_ty_1,
    pub reserved: __u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_odp_caps__bindgen_ty_1 {
    pub rc_odp_caps: __u32,
    pub uc_odp_caps: __u32,
    pub ud_odp_caps: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_odp_caps__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_odp_caps__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(ib_uverbs_odp_caps__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_odp_caps__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ib_uverbs_odp_caps__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_odp_caps__bindgen_ty_1>())).rc_odp_caps as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_odp_caps__bindgen_ty_1),
            "::",
            stringify!(rc_odp_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_odp_caps__bindgen_ty_1>())).uc_odp_caps as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_odp_caps__bindgen_ty_1),
            "::",
            stringify!(uc_odp_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_odp_caps__bindgen_ty_1>())).ud_odp_caps as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_odp_caps__bindgen_ty_1),
            "::",
            stringify!(ud_odp_caps)
        )
    );
}
#[test]
fn bindgen_test_layout_ib_uverbs_odp_caps() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_odp_caps>(),
        24usize,
        concat!("Size of: ", stringify!(ib_uverbs_odp_caps))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_odp_caps>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_odp_caps))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_odp_caps>())).general_caps as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_odp_caps),
            "::",
            stringify!(general_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_odp_caps>())).per_transport_caps as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_odp_caps),
            "::",
            stringify!(per_transport_caps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_odp_caps>())).reserved as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_odp_caps),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_rss_caps {
    pub supported_qpts: __u32,
    pub max_rwq_indirection_tables: __u32,
    pub max_rwq_indirection_table_size: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_rss_caps() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_rss_caps>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_rss_caps))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_rss_caps>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_rss_caps))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_rss_caps>())).supported_qpts as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rss_caps),
            "::",
            stringify!(supported_qpts)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_rss_caps>())).max_rwq_indirection_tables as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rss_caps),
            "::",
            stringify!(max_rwq_indirection_tables)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_rss_caps>())).max_rwq_indirection_table_size
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rss_caps),
            "::",
            stringify!(max_rwq_indirection_table_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rss_caps>())).reserved as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rss_caps),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_tm_caps {
    pub max_rndv_hdr_size: __u32,
    pub max_num_tags: __u32,
    pub flags: __u32,
    pub max_ops: __u32,
    pub max_sge: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_tm_caps() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_tm_caps>(),
        24usize,
        concat!("Size of: ", stringify!(ib_uverbs_tm_caps))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_tm_caps>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_tm_caps))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_tm_caps>())).max_rndv_hdr_size as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_tm_caps),
            "::",
            stringify!(max_rndv_hdr_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_tm_caps>())).max_num_tags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_tm_caps),
            "::",
            stringify!(max_num_tags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_tm_caps>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_tm_caps),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_tm_caps>())).max_ops as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_tm_caps),
            "::",
            stringify!(max_ops)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_tm_caps>())).max_sge as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_tm_caps),
            "::",
            stringify!(max_sge)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_tm_caps>())).reserved as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_tm_caps),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_query_device_resp {
    pub base: ib_uverbs_query_device_resp,
    pub comp_mask: __u32,
    pub response_length: __u32,
    pub odp_caps: ib_uverbs_odp_caps,
    pub timestamp_mask: __u64,
    pub hca_core_clock: __u64,
    pub device_cap_flags_ex: __u64,
    pub rss_caps: ib_uverbs_rss_caps,
    pub max_wq_type_rq: __u32,
    pub raw_packet_caps: __u32,
    pub tm_caps: ib_uverbs_tm_caps,
    pub cq_moderation_caps: ib_uverbs_cq_moderation_caps,
    pub max_dm_size: __u64,
    pub xrc_odp_caps: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_ex_query_device_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_ex_query_device_resp>(),
        304usize,
        concat!("Size of: ", stringify!(ib_uverbs_ex_query_device_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_ex_query_device_resp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_ex_query_device_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).base as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).comp_mask as *const _
                as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(comp_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).response_length as *const _
                as usize
        },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(response_length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).odp_caps as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(odp_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).timestamp_mask as *const _
                as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(timestamp_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).hca_core_clock as *const _
                as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(hca_core_clock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).device_cap_flags_ex
                as *const _ as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(device_cap_flags_ex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).rss_caps as *const _ as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(rss_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).max_wq_type_rq as *const _
                as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(max_wq_type_rq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).raw_packet_caps as *const _
                as usize
        },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(raw_packet_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).tm_caps as *const _ as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(tm_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).cq_moderation_caps
                as *const _ as usize
        },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(cq_moderation_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).max_dm_size as *const _
                as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(max_dm_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).xrc_odp_caps as *const _
                as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(xrc_odp_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_query_device_resp>())).reserved as *const _ as usize
        },
        300usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_query_device_resp),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_query_port {
    pub response: __u64,
    pub port_num: __u8,
    pub reserved: [__u8; 7usize],
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_query_port() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_query_port>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_query_port))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_query_port>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_query_port))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_port>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_port>())).port_num as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port),
            "::",
            stringify!(port_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_port>())).reserved as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port>())).driver_data as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_query_port_resp {
    pub port_cap_flags: __u32,
    pub max_msg_sz: __u32,
    pub bad_pkey_cntr: __u32,
    pub qkey_viol_cntr: __u32,
    pub gid_tbl_len: __u32,
    pub pkey_tbl_len: __u16,
    pub lid: __u16,
    pub sm_lid: __u16,
    pub state: __u8,
    pub max_mtu: __u8,
    pub active_mtu: __u8,
    pub lmc: __u8,
    pub max_vl_num: __u8,
    pub sm_sl: __u8,
    pub subnet_timeout: __u8,
    pub init_type_reply: __u8,
    pub active_width: __u8,
    pub active_speed: __u8,
    pub phys_state: __u8,
    pub link_layer: __u8,
    pub flags: __u8,
    pub reserved: __u8,
}
#[test]
fn bindgen_test_layout_ib_uverbs_query_port_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_query_port_resp>(),
        40usize,
        concat!("Size of: ", stringify!(ib_uverbs_query_port_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_query_port_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_query_port_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).port_cap_flags as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(port_cap_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).max_msg_sz as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(max_msg_sz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).bad_pkey_cntr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(bad_pkey_cntr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).qkey_viol_cntr as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(qkey_viol_cntr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).gid_tbl_len as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(gid_tbl_len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).pkey_tbl_len as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(pkey_tbl_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).lid as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(lid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).sm_lid as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(sm_lid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).state as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).max_mtu as *const _ as usize
        },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(max_mtu)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).active_mtu as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(active_mtu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).lmc as *const _ as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(lmc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).max_vl_num as *const _ as usize
        },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(max_vl_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).sm_sl as *const _ as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(sm_sl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).subnet_timeout as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(subnet_timeout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).init_type_reply as *const _
                as usize
        },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(init_type_reply)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).active_width as *const _ as usize
        },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(active_width)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).active_speed as *const _ as usize
        },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(active_speed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).phys_state as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(phys_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).link_layer as *const _ as usize
        },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(link_layer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).flags as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_port_resp>())).reserved as *const _ as usize
        },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_port_resp),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_alloc_pd {
    pub response: __u64,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_alloc_pd() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_alloc_pd>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_alloc_pd))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_alloc_pd>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_alloc_pd))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_alloc_pd>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_pd),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_alloc_pd>())).driver_data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_pd),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_alloc_pd_resp {
    pub pd_handle: __u32,
    pub driver_data: __IncompleteArrayField<__u32>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_alloc_pd_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_alloc_pd_resp>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_alloc_pd_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_alloc_pd_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_alloc_pd_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_alloc_pd_resp>())).pd_handle as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_pd_resp),
            "::",
            stringify!(pd_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_alloc_pd_resp>())).driver_data as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_pd_resp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_dealloc_pd {
    pub pd_handle: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_dealloc_pd() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_dealloc_pd>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_dealloc_pd))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_dealloc_pd>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_dealloc_pd))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_dealloc_pd>())).pd_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_dealloc_pd),
            "::",
            stringify!(pd_handle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_open_xrcd {
    pub response: __u64,
    pub fd: __u32,
    pub oflags: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_open_xrcd() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_open_xrcd>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_open_xrcd))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_open_xrcd>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_open_xrcd))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_open_xrcd>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_xrcd),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_open_xrcd>())).fd as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_xrcd),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_open_xrcd>())).oflags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_xrcd),
            "::",
            stringify!(oflags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_open_xrcd>())).driver_data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_xrcd),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_open_xrcd_resp {
    pub xrcd_handle: __u32,
    pub driver_data: __IncompleteArrayField<__u32>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_open_xrcd_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_open_xrcd_resp>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_open_xrcd_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_open_xrcd_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_open_xrcd_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_open_xrcd_resp>())).xrcd_handle as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_xrcd_resp),
            "::",
            stringify!(xrcd_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_open_xrcd_resp>())).driver_data as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_xrcd_resp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_close_xrcd {
    pub xrcd_handle: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_close_xrcd() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_close_xrcd>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_close_xrcd))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_close_xrcd>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_close_xrcd))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_close_xrcd>())).xrcd_handle as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_close_xrcd),
            "::",
            stringify!(xrcd_handle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_reg_mr {
    pub response: __u64,
    pub start: __u64,
    pub length: __u64,
    pub hca_va: __u64,
    pub pd_handle: __u32,
    pub access_flags: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_reg_mr() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_reg_mr>(),
        40usize,
        concat!("Size of: ", stringify!(ib_uverbs_reg_mr))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_reg_mr>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_reg_mr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_reg_mr>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_reg_mr),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_reg_mr>())).start as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_reg_mr),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_reg_mr>())).length as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_reg_mr),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_reg_mr>())).hca_va as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_reg_mr),
            "::",
            stringify!(hca_va)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_reg_mr>())).pd_handle as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_reg_mr),
            "::",
            stringify!(pd_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_reg_mr>())).access_flags as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_reg_mr),
            "::",
            stringify!(access_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_reg_mr>())).driver_data as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_reg_mr),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_reg_mr_resp {
    pub mr_handle: __u32,
    pub lkey: __u32,
    pub rkey: __u32,
    pub driver_data: __IncompleteArrayField<__u32>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_reg_mr_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_reg_mr_resp>(),
        12usize,
        concat!("Size of: ", stringify!(ib_uverbs_reg_mr_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_reg_mr_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_reg_mr_resp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_reg_mr_resp>())).mr_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_reg_mr_resp),
            "::",
            stringify!(mr_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_reg_mr_resp>())).lkey as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_reg_mr_resp),
            "::",
            stringify!(lkey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_reg_mr_resp>())).rkey as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_reg_mr_resp),
            "::",
            stringify!(rkey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_reg_mr_resp>())).driver_data as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_reg_mr_resp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_rereg_mr {
    pub response: __u64,
    pub mr_handle: __u32,
    pub flags: __u32,
    pub start: __u64,
    pub length: __u64,
    pub hca_va: __u64,
    pub pd_handle: __u32,
    pub access_flags: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_rereg_mr() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_rereg_mr>(),
        48usize,
        concat!("Size of: ", stringify!(ib_uverbs_rereg_mr))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_rereg_mr>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_rereg_mr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rereg_mr>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rereg_mr>())).mr_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr),
            "::",
            stringify!(mr_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rereg_mr>())).flags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rereg_mr>())).start as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rereg_mr>())).length as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rereg_mr>())).hca_va as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr),
            "::",
            stringify!(hca_va)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rereg_mr>())).pd_handle as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr),
            "::",
            stringify!(pd_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rereg_mr>())).access_flags as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr),
            "::",
            stringify!(access_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rereg_mr>())).driver_data as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_rereg_mr_resp {
    pub lkey: __u32,
    pub rkey: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_rereg_mr_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_rereg_mr_resp>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_rereg_mr_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_rereg_mr_resp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_rereg_mr_resp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rereg_mr_resp>())).lkey as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr_resp),
            "::",
            stringify!(lkey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_rereg_mr_resp>())).rkey as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr_resp),
            "::",
            stringify!(rkey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_rereg_mr_resp>())).driver_data as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_rereg_mr_resp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_dereg_mr {
    pub mr_handle: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_dereg_mr() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_dereg_mr>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_dereg_mr))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_dereg_mr>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_dereg_mr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_dereg_mr>())).mr_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_dereg_mr),
            "::",
            stringify!(mr_handle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_alloc_mw {
    pub response: __u64,
    pub pd_handle: __u32,
    pub mw_type: __u8,
    pub reserved: [__u8; 3usize],
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_alloc_mw() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_alloc_mw>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_alloc_mw))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_alloc_mw>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_alloc_mw))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_alloc_mw>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_mw),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_alloc_mw>())).pd_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_mw),
            "::",
            stringify!(pd_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_alloc_mw>())).mw_type as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_mw),
            "::",
            stringify!(mw_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_alloc_mw>())).reserved as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_mw),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_alloc_mw>())).driver_data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_mw),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_alloc_mw_resp {
    pub mw_handle: __u32,
    pub rkey: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_alloc_mw_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_alloc_mw_resp>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_alloc_mw_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_alloc_mw_resp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_alloc_mw_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_alloc_mw_resp>())).mw_handle as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_mw_resp),
            "::",
            stringify!(mw_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_alloc_mw_resp>())).rkey as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_mw_resp),
            "::",
            stringify!(rkey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_alloc_mw_resp>())).driver_data as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_alloc_mw_resp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_dealloc_mw {
    pub mw_handle: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_dealloc_mw() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_dealloc_mw>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_dealloc_mw))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_dealloc_mw>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_dealloc_mw))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_dealloc_mw>())).mw_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_dealloc_mw),
            "::",
            stringify!(mw_handle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_create_comp_channel {
    pub response: __u64,
}
#[test]
fn bindgen_test_layout_ib_uverbs_create_comp_channel() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_create_comp_channel>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_create_comp_channel))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_create_comp_channel>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_create_comp_channel))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_comp_channel>())).response as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_comp_channel),
            "::",
            stringify!(response)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_create_comp_channel_resp {
    pub fd: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_create_comp_channel_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_create_comp_channel_resp>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_create_comp_channel_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_create_comp_channel_resp>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ib_uverbs_create_comp_channel_resp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_comp_channel_resp>())).fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_comp_channel_resp),
            "::",
            stringify!(fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_cq {
    pub response: __u64,
    pub user_handle: __u64,
    pub cqe: __u32,
    pub comp_vector: __u32,
    pub comp_channel: __s32,
    pub reserved: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_create_cq() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_create_cq>(),
        32usize,
        concat!("Size of: ", stringify!(ib_uverbs_create_cq))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_create_cq>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_create_cq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_cq>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_cq),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_cq>())).user_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_cq),
            "::",
            stringify!(user_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_cq>())).cqe as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_cq),
            "::",
            stringify!(cqe)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_cq>())).comp_vector as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_cq),
            "::",
            stringify!(comp_vector)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_cq>())).comp_channel as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_cq),
            "::",
            stringify!(comp_channel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_cq>())).reserved as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_cq),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_cq>())).driver_data as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_cq),
            "::",
            stringify!(driver_data)
        )
    );
}
pub const IB_UVERBS_CQ_FLAGS_TIMESTAMP_COMPLETION: ib_uverbs_ex_create_cq_flags = 1;
pub const IB_UVERBS_CQ_FLAGS_IGNORE_OVERRUN: ib_uverbs_ex_create_cq_flags = 2;
pub type ib_uverbs_ex_create_cq_flags = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_create_cq {
    pub user_handle: __u64,
    pub cqe: __u32,
    pub comp_vector: __u32,
    pub comp_channel: __s32,
    pub comp_mask: __u32,
    pub flags: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_ex_create_cq() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_ex_create_cq>(),
        32usize,
        concat!("Size of: ", stringify!(ib_uverbs_ex_create_cq))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_ex_create_cq>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_ex_create_cq))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_cq>())).user_handle as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_cq),
            "::",
            stringify!(user_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ex_create_cq>())).cqe as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_cq),
            "::",
            stringify!(cqe)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_cq>())).comp_vector as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_cq),
            "::",
            stringify!(comp_vector)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_cq>())).comp_channel as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_cq),
            "::",
            stringify!(comp_channel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_cq>())).comp_mask as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_cq),
            "::",
            stringify!(comp_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ex_create_cq>())).flags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_cq),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ex_create_cq>())).reserved as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_cq),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_cq_resp {
    pub cq_handle: __u32,
    pub cqe: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_create_cq_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_create_cq_resp>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_create_cq_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_create_cq_resp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_create_cq_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_cq_resp>())).cq_handle as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_cq_resp),
            "::",
            stringify!(cq_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_cq_resp>())).cqe as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_cq_resp),
            "::",
            stringify!(cqe)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_cq_resp>())).driver_data as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_cq_resp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_ex_create_cq_resp {
    pub base: ib_uverbs_create_cq_resp,
    pub comp_mask: __u32,
    pub response_length: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_ex_create_cq_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_ex_create_cq_resp>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_ex_create_cq_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_ex_create_cq_resp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_ex_create_cq_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_cq_resp>())).base as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_cq_resp),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_cq_resp>())).comp_mask as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_cq_resp),
            "::",
            stringify!(comp_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_cq_resp>())).response_length as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_cq_resp),
            "::",
            stringify!(response_length)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_resize_cq {
    pub response: __u64,
    pub cq_handle: __u32,
    pub cqe: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_resize_cq() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_resize_cq>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_resize_cq))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_resize_cq>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_resize_cq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_resize_cq>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_resize_cq),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_resize_cq>())).cq_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_resize_cq),
            "::",
            stringify!(cq_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_resize_cq>())).cqe as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_resize_cq),
            "::",
            stringify!(cqe)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_resize_cq>())).driver_data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_resize_cq),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_resize_cq_resp {
    pub cqe: __u32,
    pub reserved: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_resize_cq_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_resize_cq_resp>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_resize_cq_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_resize_cq_resp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_resize_cq_resp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_resize_cq_resp>())).cqe as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_resize_cq_resp),
            "::",
            stringify!(cqe)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_resize_cq_resp>())).reserved as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_resize_cq_resp),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_resize_cq_resp>())).driver_data as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_resize_cq_resp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_poll_cq {
    pub response: __u64,
    pub cq_handle: __u32,
    pub ne: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_poll_cq() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_poll_cq>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_poll_cq))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_poll_cq>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_poll_cq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_poll_cq>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_poll_cq),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_poll_cq>())).cq_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_poll_cq),
            "::",
            stringify!(cq_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_poll_cq>())).ne as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_poll_cq),
            "::",
            stringify!(ne)
        )
    );
}
pub const IB_UVERBS_WC_SEND: ib_uverbs_wc_opcode = 0;
pub const IB_UVERBS_WC_RDMA_WRITE: ib_uverbs_wc_opcode = 1;
pub const IB_UVERBS_WC_RDMA_READ: ib_uverbs_wc_opcode = 2;
pub const IB_UVERBS_WC_COMP_SWAP: ib_uverbs_wc_opcode = 3;
pub const IB_UVERBS_WC_FETCH_ADD: ib_uverbs_wc_opcode = 4;
pub const IB_UVERBS_WC_BIND_MW: ib_uverbs_wc_opcode = 5;
pub const IB_UVERBS_WC_LOCAL_INV: ib_uverbs_wc_opcode = 6;
pub const IB_UVERBS_WC_TSO: ib_uverbs_wc_opcode = 7;
pub type ib_uverbs_wc_opcode = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ib_uverbs_wc {
    pub wr_id: __u64,
    pub status: __u32,
    pub opcode: __u32,
    pub vendor_err: __u32,
    pub byte_len: __u32,
    pub ex: ib_uverbs_wc__bindgen_ty_1,
    pub qp_num: __u32,
    pub src_qp: __u32,
    pub wc_flags: __u32,
    pub pkey_index: __u16,
    pub slid: __u16,
    pub sl: __u8,
    pub dlid_path_bits: __u8,
    pub port_num: __u8,
    pub reserved: __u8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ib_uverbs_wc__bindgen_ty_1 {
    pub imm_data: __be32,
    pub invalidate_rkey: __u32,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_wc__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_wc__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_wc__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_wc__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_wc__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_wc__bindgen_ty_1>())).imm_data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc__bindgen_ty_1),
            "::",
            stringify!(imm_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_wc__bindgen_ty_1>())).invalidate_rkey as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc__bindgen_ty_1),
            "::",
            stringify!(invalidate_rkey)
        )
    );
}
impl Default for ib_uverbs_wc__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_ib_uverbs_wc() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_wc>(),
        48usize,
        concat!("Size of: ", stringify!(ib_uverbs_wc))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_wc>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_wc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).wr_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(wr_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).status as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).opcode as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(opcode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).vendor_err as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(vendor_err)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).byte_len as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(byte_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).ex as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(ex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).qp_num as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(qp_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).src_qp as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(src_qp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).wc_flags as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(wc_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).pkey_index as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(pkey_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).slid as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(slid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).sl as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(sl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).dlid_path_bits as *const _ as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(dlid_path_bits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).port_num as *const _ as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(port_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_wc>())).reserved as *const _ as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_wc),
            "::",
            stringify!(reserved)
        )
    );
}
impl Default for ib_uverbs_wc {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
pub struct ib_uverbs_poll_cq_resp {
    pub count: __u32,
    pub reserved: __u32,
    pub wc: __IncompleteArrayField<ib_uverbs_wc>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_poll_cq_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_poll_cq_resp>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_poll_cq_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_poll_cq_resp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_poll_cq_resp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_poll_cq_resp>())).count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_poll_cq_resp),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_poll_cq_resp>())).reserved as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_poll_cq_resp),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_poll_cq_resp>())).wc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_poll_cq_resp),
            "::",
            stringify!(wc)
        )
    );
}
impl Default for ib_uverbs_poll_cq_resp {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_req_notify_cq {
    pub cq_handle: __u32,
    pub solicited_only: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_req_notify_cq() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_req_notify_cq>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_req_notify_cq))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_req_notify_cq>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_req_notify_cq))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_req_notify_cq>())).cq_handle as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_req_notify_cq),
            "::",
            stringify!(cq_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_req_notify_cq>())).solicited_only as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_req_notify_cq),
            "::",
            stringify!(solicited_only)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_cq {
    pub response: __u64,
    pub cq_handle: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_destroy_cq() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_destroy_cq>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_destroy_cq))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_destroy_cq>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_destroy_cq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_destroy_cq>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_destroy_cq),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_destroy_cq>())).cq_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_destroy_cq),
            "::",
            stringify!(cq_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_destroy_cq>())).reserved as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_destroy_cq),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_cq_resp {
    pub comp_events_reported: __u32,
    pub async_events_reported: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_destroy_cq_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_destroy_cq_resp>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_destroy_cq_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_destroy_cq_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_destroy_cq_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_destroy_cq_resp>())).comp_events_reported as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_destroy_cq_resp),
            "::",
            stringify!(comp_events_reported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_destroy_cq_resp>())).async_events_reported as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_destroy_cq_resp),
            "::",
            stringify!(async_events_reported)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_global_route {
    pub dgid: [__u8; 16usize],
    pub flow_label: __u32,
    pub sgid_index: __u8,
    pub hop_limit: __u8,
    pub traffic_class: __u8,
    pub reserved: __u8,
}
#[test]
fn bindgen_test_layout_ib_uverbs_global_route() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_global_route>(),
        24usize,
        concat!("Size of: ", stringify!(ib_uverbs_global_route))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_global_route>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_global_route))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_global_route>())).dgid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_global_route),
            "::",
            stringify!(dgid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_global_route>())).flow_label as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_global_route),
            "::",
            stringify!(flow_label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_global_route>())).sgid_index as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_global_route),
            "::",
            stringify!(sgid_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_global_route>())).hop_limit as *const _ as usize
        },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_global_route),
            "::",
            stringify!(hop_limit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_global_route>())).traffic_class as *const _ as usize
        },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_global_route),
            "::",
            stringify!(traffic_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_global_route>())).reserved as *const _ as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_global_route),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ah_attr {
    pub grh: ib_uverbs_global_route,
    pub dlid: __u16,
    pub sl: __u8,
    pub src_path_bits: __u8,
    pub static_rate: __u8,
    pub is_global: __u8,
    pub port_num: __u8,
    pub reserved: __u8,
}
#[test]
fn bindgen_test_layout_ib_uverbs_ah_attr() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_ah_attr>(),
        32usize,
        concat!("Size of: ", stringify!(ib_uverbs_ah_attr))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_ah_attr>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_ah_attr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ah_attr>())).grh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ah_attr),
            "::",
            stringify!(grh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ah_attr>())).dlid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ah_attr),
            "::",
            stringify!(dlid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ah_attr>())).sl as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ah_attr),
            "::",
            stringify!(sl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ah_attr>())).src_path_bits as *const _ as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ah_attr),
            "::",
            stringify!(src_path_bits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ah_attr>())).static_rate as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ah_attr),
            "::",
            stringify!(static_rate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ah_attr>())).is_global as *const _ as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ah_attr),
            "::",
            stringify!(is_global)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ah_attr>())).port_num as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ah_attr),
            "::",
            stringify!(port_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ah_attr>())).reserved as *const _ as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ah_attr),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_qp_attr {
    pub qp_attr_mask: __u32,
    pub qp_state: __u32,
    pub cur_qp_state: __u32,
    pub path_mtu: __u32,
    pub path_mig_state: __u32,
    pub qkey: __u32,
    pub rq_psn: __u32,
    pub sq_psn: __u32,
    pub dest_qp_num: __u32,
    pub qp_access_flags: __u32,
    pub ah_attr: ib_uverbs_ah_attr,
    pub alt_ah_attr: ib_uverbs_ah_attr,
    pub max_send_wr: __u32,
    pub max_recv_wr: __u32,
    pub max_send_sge: __u32,
    pub max_recv_sge: __u32,
    pub max_inline_data: __u32,
    pub pkey_index: __u16,
    pub alt_pkey_index: __u16,
    pub en_sqd_async_notify: __u8,
    pub sq_draining: __u8,
    pub max_rd_atomic: __u8,
    pub max_dest_rd_atomic: __u8,
    pub min_rnr_timer: __u8,
    pub port_num: __u8,
    pub timeout: __u8,
    pub retry_cnt: __u8,
    pub rnr_retry: __u8,
    pub alt_port_num: __u8,
    pub alt_timeout: __u8,
    pub reserved: [__u8; 5usize],
}
#[test]
fn bindgen_test_layout_ib_uverbs_qp_attr() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_qp_attr>(),
        144usize,
        concat!("Size of: ", stringify!(ib_uverbs_qp_attr))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_qp_attr>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_qp_attr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).qp_attr_mask as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(qp_attr_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).qp_state as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(qp_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).cur_qp_state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(cur_qp_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).path_mtu as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(path_mtu)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).path_mig_state as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(path_mig_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).qkey as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(qkey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).rq_psn as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(rq_psn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).sq_psn as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(sq_psn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).dest_qp_num as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(dest_qp_num)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).qp_access_flags as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(qp_access_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).ah_attr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(ah_attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).alt_ah_attr as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(alt_ah_attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).max_send_wr as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(max_send_wr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).max_recv_wr as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(max_recv_wr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).max_send_sge as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(max_send_sge)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).max_recv_sge as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(max_recv_sge)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).max_inline_data as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(max_inline_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).pkey_index as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(pkey_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).alt_pkey_index as *const _ as usize
        },
        126usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(alt_pkey_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).en_sqd_async_notify as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(en_sqd_async_notify)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).sq_draining as *const _ as usize },
        129usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(sq_draining)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).max_rd_atomic as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(max_rd_atomic)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).max_dest_rd_atomic as *const _ as usize
        },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(max_dest_rd_atomic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).min_rnr_timer as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(min_rnr_timer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).port_num as *const _ as usize },
        133usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(port_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).timeout as *const _ as usize },
        134usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).retry_cnt as *const _ as usize },
        135usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(retry_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).rnr_retry as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(rnr_retry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).alt_port_num as *const _ as usize },
        137usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(alt_port_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).alt_timeout as *const _ as usize },
        138usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(alt_timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_attr>())).reserved as *const _ as usize },
        139usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_attr),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_qp {
    pub response: __u64,
    pub user_handle: __u64,
    pub pd_handle: __u32,
    pub send_cq_handle: __u32,
    pub recv_cq_handle: __u32,
    pub srq_handle: __u32,
    pub max_send_wr: __u32,
    pub max_recv_wr: __u32,
    pub max_send_sge: __u32,
    pub max_recv_sge: __u32,
    pub max_inline_data: __u32,
    pub sq_sig_all: __u8,
    pub qp_type: __u8,
    pub is_srq: __u8,
    pub reserved: __u8,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_create_qp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_create_qp>(),
        56usize,
        concat!("Size of: ", stringify!(ib_uverbs_create_qp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_create_qp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_create_qp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp>())).user_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(user_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp>())).pd_handle as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(pd_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp>())).send_cq_handle as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(send_cq_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp>())).recv_cq_handle as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(recv_cq_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp>())).srq_handle as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(srq_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp>())).max_send_wr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(max_send_wr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp>())).max_recv_wr as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(max_recv_wr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp>())).max_send_sge as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(max_send_sge)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp>())).max_recv_sge as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(max_recv_sge)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp>())).max_inline_data as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(max_inline_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp>())).sq_sig_all as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(sq_sig_all)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp>())).qp_type as *const _ as usize },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(qp_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp>())).is_srq as *const _ as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(is_srq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp>())).reserved as *const _ as usize },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp>())).driver_data as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp),
            "::",
            stringify!(driver_data)
        )
    );
}
pub const IB_UVERBS_CREATE_QP_MASK_IND_TABLE: ib_uverbs_create_qp_mask = 1;
pub type ib_uverbs_create_qp_mask = u32;
pub const IB_UVERBS_CREATE_QP_SUP_COMP_MASK: _bindgen_ty_12 = 1;
pub type _bindgen_ty_12 = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_create_qp {
    pub user_handle: __u64,
    pub pd_handle: __u32,
    pub send_cq_handle: __u32,
    pub recv_cq_handle: __u32,
    pub srq_handle: __u32,
    pub max_send_wr: __u32,
    pub max_recv_wr: __u32,
    pub max_send_sge: __u32,
    pub max_recv_sge: __u32,
    pub max_inline_data: __u32,
    pub sq_sig_all: __u8,
    pub qp_type: __u8,
    pub is_srq: __u8,
    pub reserved: __u8,
    pub comp_mask: __u32,
    pub create_flags: __u32,
    pub rwq_ind_tbl_handle: __u32,
    pub source_qpn: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_ex_create_qp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_ex_create_qp>(),
        64usize,
        concat!("Size of: ", stringify!(ib_uverbs_ex_create_qp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_ex_create_qp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_ex_create_qp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).user_handle as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(user_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).pd_handle as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(pd_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).send_cq_handle as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(send_cq_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).recv_cq_handle as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(recv_cq_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).srq_handle as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(srq_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).max_send_wr as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(max_send_wr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).max_recv_wr as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(max_recv_wr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).max_send_sge as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(max_send_sge)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).max_recv_sge as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(max_recv_sge)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).max_inline_data as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(max_inline_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).sq_sig_all as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(sq_sig_all)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).qp_type as *const _ as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(qp_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).is_srq as *const _ as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(is_srq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).reserved as *const _ as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).comp_mask as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(comp_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).create_flags as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(create_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).rwq_ind_tbl_handle as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(rwq_ind_tbl_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp>())).source_qpn as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp),
            "::",
            stringify!(source_qpn)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_open_qp {
    pub response: __u64,
    pub user_handle: __u64,
    pub pd_handle: __u32,
    pub qpn: __u32,
    pub qp_type: __u8,
    pub reserved: [__u8; 7usize],
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_open_qp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_open_qp>(),
        32usize,
        concat!("Size of: ", stringify!(ib_uverbs_open_qp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_open_qp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_open_qp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_open_qp>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_qp),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_open_qp>())).user_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_qp),
            "::",
            stringify!(user_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_open_qp>())).pd_handle as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_qp),
            "::",
            stringify!(pd_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_open_qp>())).qpn as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_qp),
            "::",
            stringify!(qpn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_open_qp>())).qp_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_qp),
            "::",
            stringify!(qp_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_open_qp>())).reserved as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_qp),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_open_qp>())).driver_data as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_open_qp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_qp_resp {
    pub qp_handle: __u32,
    pub qpn: __u32,
    pub max_send_wr: __u32,
    pub max_recv_wr: __u32,
    pub max_send_sge: __u32,
    pub max_recv_sge: __u32,
    pub max_inline_data: __u32,
    pub reserved: __u32,
    pub driver_data: __IncompleteArrayField<__u32>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_create_qp_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_create_qp_resp>(),
        32usize,
        concat!("Size of: ", stringify!(ib_uverbs_create_qp_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_create_qp_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_create_qp_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp_resp>())).qp_handle as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp_resp),
            "::",
            stringify!(qp_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_qp_resp>())).qpn as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp_resp),
            "::",
            stringify!(qpn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp_resp>())).max_send_wr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp_resp),
            "::",
            stringify!(max_send_wr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp_resp>())).max_recv_wr as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp_resp),
            "::",
            stringify!(max_recv_wr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp_resp>())).max_send_sge as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp_resp),
            "::",
            stringify!(max_send_sge)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp_resp>())).max_recv_sge as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp_resp),
            "::",
            stringify!(max_recv_sge)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp_resp>())).max_inline_data as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp_resp),
            "::",
            stringify!(max_inline_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp_resp>())).reserved as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp_resp),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_qp_resp>())).driver_data as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_qp_resp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_ex_create_qp_resp {
    pub base: ib_uverbs_create_qp_resp,
    pub comp_mask: __u32,
    pub response_length: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_ex_create_qp_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_ex_create_qp_resp>(),
        40usize,
        concat!("Size of: ", stringify!(ib_uverbs_ex_create_qp_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_ex_create_qp_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_ex_create_qp_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp_resp>())).base as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp_resp),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp_resp>())).comp_mask as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp_resp),
            "::",
            stringify!(comp_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_create_qp_resp>())).response_length as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_create_qp_resp),
            "::",
            stringify!(response_length)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_qp_dest {
    pub dgid: [__u8; 16usize],
    pub flow_label: __u32,
    pub dlid: __u16,
    pub reserved: __u16,
    pub sgid_index: __u8,
    pub hop_limit: __u8,
    pub traffic_class: __u8,
    pub sl: __u8,
    pub src_path_bits: __u8,
    pub static_rate: __u8,
    pub is_global: __u8,
    pub port_num: __u8,
}
#[test]
fn bindgen_test_layout_ib_uverbs_qp_dest() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_qp_dest>(),
        32usize,
        concat!("Size of: ", stringify!(ib_uverbs_qp_dest))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_qp_dest>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_qp_dest))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).dgid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(dgid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).flow_label as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(flow_label)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).dlid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(dlid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).reserved as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).sgid_index as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(sgid_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).hop_limit as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(hop_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).traffic_class as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(traffic_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).sl as *const _ as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(sl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).src_path_bits as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(src_path_bits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).static_rate as *const _ as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(static_rate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).is_global as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(is_global)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_qp_dest>())).port_num as *const _ as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_qp_dest),
            "::",
            stringify!(port_num)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_query_qp {
    pub response: __u64,
    pub qp_handle: __u32,
    pub attr_mask: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_query_qp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_query_qp>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_query_qp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_query_qp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_query_qp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_qp>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_qp>())).qp_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp),
            "::",
            stringify!(qp_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_qp>())).attr_mask as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp),
            "::",
            stringify!(attr_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_qp>())).driver_data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_query_qp_resp {
    pub dest: ib_uverbs_qp_dest,
    pub alt_dest: ib_uverbs_qp_dest,
    pub max_send_wr: __u32,
    pub max_recv_wr: __u32,
    pub max_send_sge: __u32,
    pub max_recv_sge: __u32,
    pub max_inline_data: __u32,
    pub qkey: __u32,
    pub rq_psn: __u32,
    pub sq_psn: __u32,
    pub dest_qp_num: __u32,
    pub qp_access_flags: __u32,
    pub pkey_index: __u16,
    pub alt_pkey_index: __u16,
    pub qp_state: __u8,
    pub cur_qp_state: __u8,
    pub path_mtu: __u8,
    pub path_mig_state: __u8,
    pub sq_draining: __u8,
    pub max_rd_atomic: __u8,
    pub max_dest_rd_atomic: __u8,
    pub min_rnr_timer: __u8,
    pub port_num: __u8,
    pub timeout: __u8,
    pub retry_cnt: __u8,
    pub rnr_retry: __u8,
    pub alt_port_num: __u8,
    pub alt_timeout: __u8,
    pub sq_sig_all: __u8,
    pub reserved: [__u8; 5usize],
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_query_qp_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_query_qp_resp>(),
        128usize,
        concat!("Size of: ", stringify!(ib_uverbs_query_qp_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_query_qp_resp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_query_qp_resp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).dest as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(dest)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).alt_dest as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(alt_dest)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).max_send_wr as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(max_send_wr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).max_recv_wr as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(max_recv_wr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).max_send_sge as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(max_send_sge)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).max_recv_sge as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(max_recv_sge)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).max_inline_data as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(max_inline_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).qkey as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(qkey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).rq_psn as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(rq_psn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).sq_psn as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(sq_psn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).dest_qp_num as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(dest_qp_num)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).qp_access_flags as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(qp_access_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).pkey_index as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(pkey_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).alt_pkey_index as *const _ as usize
        },
        106usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(alt_pkey_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).qp_state as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(qp_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).cur_qp_state as *const _ as usize
        },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(cur_qp_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).path_mtu as *const _ as usize
        },
        110usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(path_mtu)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).path_mig_state as *const _ as usize
        },
        111usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(path_mig_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).sq_draining as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(sq_draining)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).max_rd_atomic as *const _ as usize
        },
        113usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(max_rd_atomic)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).max_dest_rd_atomic as *const _
                as usize
        },
        114usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(max_dest_rd_atomic)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).min_rnr_timer as *const _ as usize
        },
        115usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(min_rnr_timer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).port_num as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(port_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).timeout as *const _ as usize },
        117usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).retry_cnt as *const _ as usize
        },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(retry_cnt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).rnr_retry as *const _ as usize
        },
        119usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(rnr_retry)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).alt_port_num as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(alt_port_num)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).alt_timeout as *const _ as usize
        },
        121usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(alt_timeout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).sq_sig_all as *const _ as usize
        },
        122usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(sq_sig_all)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).reserved as *const _ as usize
        },
        123usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_query_qp_resp>())).driver_data as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_query_qp_resp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_modify_qp {
    pub dest: ib_uverbs_qp_dest,
    pub alt_dest: ib_uverbs_qp_dest,
    pub qp_handle: __u32,
    pub attr_mask: __u32,
    pub qkey: __u32,
    pub rq_psn: __u32,
    pub sq_psn: __u32,
    pub dest_qp_num: __u32,
    pub qp_access_flags: __u32,
    pub pkey_index: __u16,
    pub alt_pkey_index: __u16,
    pub qp_state: __u8,
    pub cur_qp_state: __u8,
    pub path_mtu: __u8,
    pub path_mig_state: __u8,
    pub en_sqd_async_notify: __u8,
    pub max_rd_atomic: __u8,
    pub max_dest_rd_atomic: __u8,
    pub min_rnr_timer: __u8,
    pub port_num: __u8,
    pub timeout: __u8,
    pub retry_cnt: __u8,
    pub rnr_retry: __u8,
    pub alt_port_num: __u8,
    pub alt_timeout: __u8,
    pub reserved: [__u8; 2usize],
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_modify_qp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_modify_qp>(),
        112usize,
        concat!("Size of: ", stringify!(ib_uverbs_modify_qp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_modify_qp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_modify_qp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).dest as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(dest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).alt_dest as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(alt_dest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).qp_handle as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(qp_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).attr_mask as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(attr_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).qkey as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(qkey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).rq_psn as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(rq_psn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).sq_psn as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(sq_psn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).dest_qp_num as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(dest_qp_num)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).qp_access_flags as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(qp_access_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).pkey_index as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(pkey_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).alt_pkey_index as *const _ as usize
        },
        94usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(alt_pkey_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).qp_state as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(qp_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).cur_qp_state as *const _ as usize
        },
        97usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(cur_qp_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).path_mtu as *const _ as usize },
        98usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(path_mtu)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).path_mig_state as *const _ as usize
        },
        99usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(path_mig_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).en_sqd_async_notify as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(en_sqd_async_notify)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).max_rd_atomic as *const _ as usize
        },
        101usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(max_rd_atomic)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).max_dest_rd_atomic as *const _ as usize
        },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(max_dest_rd_atomic)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).min_rnr_timer as *const _ as usize
        },
        103usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(min_rnr_timer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).port_num as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(port_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).timeout as *const _ as usize },
        105usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).retry_cnt as *const _ as usize },
        106usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(retry_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).rnr_retry as *const _ as usize },
        107usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(rnr_retry)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).alt_port_num as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(alt_port_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).alt_timeout as *const _ as usize },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(alt_timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).reserved as *const _ as usize },
        110usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_modify_qp>())).driver_data as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_modify_qp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_ex_modify_qp {
    pub base: ib_uverbs_modify_qp,
    pub rate_limit: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_ex_modify_qp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_ex_modify_qp>(),
        120usize,
        concat!("Size of: ", stringify!(ib_uverbs_ex_modify_qp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_ex_modify_qp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_ex_modify_qp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ex_modify_qp>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_modify_qp),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_modify_qp>())).rate_limit as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_modify_qp),
            "::",
            stringify!(rate_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_ex_modify_qp>())).reserved as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_modify_qp),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_modify_qp_resp {
    pub comp_mask: __u32,
    pub response_length: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_ex_modify_qp_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_ex_modify_qp_resp>(),
        8usize,
        concat!("Size of: ", stringify!(ib_uverbs_ex_modify_qp_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_ex_modify_qp_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_ex_modify_qp_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_modify_qp_resp>())).comp_mask as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_modify_qp_resp),
            "::",
            stringify!(comp_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_ex_modify_qp_resp>())).response_length as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_ex_modify_qp_resp),
            "::",
            stringify!(response_length)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_qp {
    pub response: __u64,
    pub qp_handle: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_destroy_qp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_destroy_qp>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_destroy_qp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_destroy_qp>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_destroy_qp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_destroy_qp>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_destroy_qp),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_destroy_qp>())).qp_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_destroy_qp),
            "::",
            stringify!(qp_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_destroy_qp>())).reserved as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_destroy_qp),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_qp_resp {
    pub events_reported: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_destroy_qp_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_destroy_qp_resp>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_destroy_qp_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_destroy_qp_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_destroy_qp_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_destroy_qp_resp>())).events_reported as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_destroy_qp_resp),
            "::",
            stringify!(events_reported)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_sge {
    pub addr: __u64,
    pub length: __u32,
    pub lkey: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_sge() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_sge>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_sge))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_sge>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_sge))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_sge>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_sge),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_sge>())).length as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_sge),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_sge>())).lkey as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_sge),
            "::",
            stringify!(lkey)
        )
    );
}
pub const IB_UVERBS_WR_RDMA_WRITE: ib_uverbs_wr_opcode = 0;
pub const IB_UVERBS_WR_RDMA_WRITE_WITH_IMM: ib_uverbs_wr_opcode = 1;
pub const IB_UVERBS_WR_SEND: ib_uverbs_wr_opcode = 2;
pub const IB_UVERBS_WR_SEND_WITH_IMM: ib_uverbs_wr_opcode = 3;
pub const IB_UVERBS_WR_RDMA_READ: ib_uverbs_wr_opcode = 4;
pub const IB_UVERBS_WR_ATOMIC_CMP_AND_SWP: ib_uverbs_wr_opcode = 5;
pub const IB_UVERBS_WR_ATOMIC_FETCH_AND_ADD: ib_uverbs_wr_opcode = 6;
pub const IB_UVERBS_WR_LOCAL_INV: ib_uverbs_wr_opcode = 7;
pub const IB_UVERBS_WR_BIND_MW: ib_uverbs_wr_opcode = 8;
pub const IB_UVERBS_WR_SEND_WITH_INV: ib_uverbs_wr_opcode = 9;
pub const IB_UVERBS_WR_TSO: ib_uverbs_wr_opcode = 10;
pub const IB_UVERBS_WR_RDMA_READ_WITH_INV: ib_uverbs_wr_opcode = 11;
pub const IB_UVERBS_WR_MASKED_ATOMIC_CMP_AND_SWP: ib_uverbs_wr_opcode = 12;
pub const IB_UVERBS_WR_MASKED_ATOMIC_FETCH_AND_ADD: ib_uverbs_wr_opcode = 13;
pub type ib_uverbs_wr_opcode = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ib_uverbs_send_wr {
    pub wr_id: __u64,
    pub num_sge: __u32,
    pub opcode: __u32,
    pub send_flags: __u32,
    pub ex: ib_uverbs_send_wr__bindgen_ty_1,
    pub wr: ib_uverbs_send_wr__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ib_uverbs_send_wr__bindgen_ty_1 {
    pub imm_data: __be32,
    pub invalidate_rkey: __u32,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_send_wr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_send_wr__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_send_wr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_send_wr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_send_wr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_1>())).imm_data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_1),
            "::",
            stringify!(imm_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_1>())).invalidate_rkey as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_1),
            "::",
            stringify!(invalidate_rkey)
        )
    );
}
impl Default for ib_uverbs_send_wr__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ib_uverbs_send_wr__bindgen_ty_2 {
    pub rdma: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1,
    pub atomic: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2,
    pub ud: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3,
    _bindgen_union_align: [u64; 4usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1 {
    pub remote_addr: __u64,
    pub rkey: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1>())).remote_addr
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(remote_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1>())).rkey
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(rkey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1>())).reserved
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2 {
    pub remote_addr: __u64,
    pub compare_add: __u64,
    pub swap: __u64,
    pub rkey: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2>())).remote_addr
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(remote_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2>())).compare_add
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(compare_add)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2>())).swap
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(swap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2>())).rkey
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(rkey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2>())).reserved
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3 {
    pub ah: __u32,
    pub remote_qpn: __u32,
    pub remote_qkey: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3>())).ah as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3),
            "::",
            stringify!(ah)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3>())).remote_qpn
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3),
            "::",
            stringify!(remote_qpn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3>())).remote_qkey
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3),
            "::",
            stringify!(remote_qkey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3>())).reserved
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3),
            "::",
            stringify!(reserved)
        )
    );
}
#[test]
fn bindgen_test_layout_ib_uverbs_send_wr__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_send_wr__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(ib_uverbs_send_wr__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_send_wr__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_send_wr__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2>())).rdma as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2),
            "::",
            stringify!(rdma)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2>())).atomic as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2),
            "::",
            stringify!(atomic)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_send_wr__bindgen_ty_2>())).ud as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr__bindgen_ty_2),
            "::",
            stringify!(ud)
        )
    );
}
impl Default for ib_uverbs_send_wr__bindgen_ty_2 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_ib_uverbs_send_wr() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_send_wr>(),
        56usize,
        concat!("Size of: ", stringify!(ib_uverbs_send_wr))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_send_wr>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_send_wr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_send_wr>())).wr_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr),
            "::",
            stringify!(wr_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_send_wr>())).num_sge as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr),
            "::",
            stringify!(num_sge)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_send_wr>())).opcode as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr),
            "::",
            stringify!(opcode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_send_wr>())).send_flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr),
            "::",
            stringify!(send_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_send_wr>())).ex as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr),
            "::",
            stringify!(ex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_send_wr>())).wr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_send_wr),
            "::",
            stringify!(wr)
        )
    );
}
impl Default for ib_uverbs_send_wr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
pub struct ib_uverbs_post_send {
    pub response: __u64,
    pub qp_handle: __u32,
    pub wr_count: __u32,
    pub sge_count: __u32,
    pub wqe_size: __u32,
    pub send_wr: __IncompleteArrayField<ib_uverbs_send_wr>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_post_send() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_post_send>(),
        24usize,
        concat!("Size of: ", stringify!(ib_uverbs_post_send))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_post_send>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_post_send))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_send>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_send),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_send>())).qp_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_send),
            "::",
            stringify!(qp_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_send>())).wr_count as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_send),
            "::",
            stringify!(wr_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_send>())).sge_count as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_send),
            "::",
            stringify!(sge_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_send>())).wqe_size as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_send),
            "::",
            stringify!(wqe_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_send>())).send_wr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_send),
            "::",
            stringify!(send_wr)
        )
    );
}
impl Default for ib_uverbs_post_send {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_post_send_resp {
    pub bad_wr: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_post_send_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_post_send_resp>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_post_send_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_post_send_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_post_send_resp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_send_resp>())).bad_wr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_send_resp),
            "::",
            stringify!(bad_wr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_recv_wr {
    pub wr_id: __u64,
    pub num_sge: __u32,
    pub reserved: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_recv_wr() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_recv_wr>(),
        16usize,
        concat!("Size of: ", stringify!(ib_uverbs_recv_wr))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_recv_wr>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_recv_wr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_recv_wr>())).wr_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_recv_wr),
            "::",
            stringify!(wr_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_recv_wr>())).num_sge as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_recv_wr),
            "::",
            stringify!(num_sge)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_recv_wr>())).reserved as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_recv_wr),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_post_recv {
    pub response: __u64,
    pub qp_handle: __u32,
    pub wr_count: __u32,
    pub sge_count: __u32,
    pub wqe_size: __u32,
    pub recv_wr: __IncompleteArrayField<ib_uverbs_recv_wr>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_post_recv() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_post_recv>(),
        24usize,
        concat!("Size of: ", stringify!(ib_uverbs_post_recv))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_post_recv>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_post_recv))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_recv>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_recv),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_recv>())).qp_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_recv),
            "::",
            stringify!(qp_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_recv>())).wr_count as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_recv),
            "::",
            stringify!(wr_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_recv>())).sge_count as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_recv),
            "::",
            stringify!(sge_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_recv>())).wqe_size as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_recv),
            "::",
            stringify!(wqe_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_recv>())).recv_wr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_recv),
            "::",
            stringify!(recv_wr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_post_recv_resp {
    pub bad_wr: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_post_recv_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_post_recv_resp>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_post_recv_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_post_recv_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_post_recv_resp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_recv_resp>())).bad_wr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_recv_resp),
            "::",
            stringify!(bad_wr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_post_srq_recv {
    pub response: __u64,
    pub srq_handle: __u32,
    pub wr_count: __u32,
    pub sge_count: __u32,
    pub wqe_size: __u32,
    pub recv: __IncompleteArrayField<ib_uverbs_recv_wr>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_post_srq_recv() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_post_srq_recv>(),
        24usize,
        concat!("Size of: ", stringify!(ib_uverbs_post_srq_recv))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_post_srq_recv>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_post_srq_recv))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_post_srq_recv>())).response as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_srq_recv),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_post_srq_recv>())).srq_handle as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_srq_recv),
            "::",
            stringify!(srq_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_post_srq_recv>())).wr_count as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_srq_recv),
            "::",
            stringify!(wr_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_post_srq_recv>())).sge_count as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_srq_recv),
            "::",
            stringify!(sge_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_post_srq_recv>())).wqe_size as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_srq_recv),
            "::",
            stringify!(wqe_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_post_srq_recv>())).recv as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_srq_recv),
            "::",
            stringify!(recv)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_post_srq_recv_resp {
    pub bad_wr: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_post_srq_recv_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_post_srq_recv_resp>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_post_srq_recv_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_post_srq_recv_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_post_srq_recv_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_post_srq_recv_resp>())).bad_wr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_post_srq_recv_resp),
            "::",
            stringify!(bad_wr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_ah {
    pub response: __u64,
    pub user_handle: __u64,
    pub pd_handle: __u32,
    pub reserved: __u32,
    pub attr: ib_uverbs_ah_attr,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_create_ah() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_create_ah>(),
        56usize,
        concat!("Size of: ", stringify!(ib_uverbs_create_ah))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_create_ah>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_create_ah))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_ah>())).response as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_ah),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_ah>())).user_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_ah),
            "::",
            stringify!(user_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_ah>())).pd_handle as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_ah),
            "::",
            stringify!(pd_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_ah>())).reserved as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_ah),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_ah>())).attr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_ah),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_create_ah>())).driver_data as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_ah),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_ah_resp {
    pub ah_handle: __u32,
    pub driver_data: __IncompleteArrayField<__u32>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_create_ah_resp() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_create_ah_resp>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_create_ah_resp))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_create_ah_resp>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_create_ah_resp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_ah_resp>())).ah_handle as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_ah_resp),
            "::",
            stringify!(ah_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_create_ah_resp>())).driver_data as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_create_ah_resp),
            "::",
            stringify!(driver_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_ah {
    pub ah_handle: __u32,
}
#[test]
fn bindgen_test_layout_ib_uverbs_destroy_ah() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_destroy_ah>(),
        4usize,
        concat!("Size of: ", stringify!(ib_uverbs_destroy_ah))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_destroy_ah>(),
        4usize,
        concat!("Alignment of ", stringify!(ib_uverbs_destroy_ah))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_destroy_ah>())).ah_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_destroy_ah),
            "::",
            stringify!(ah_handle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_attach_mcast {
    pub gid: [__u8; 16usize],
    pub qp_handle: __u32,
    pub mlid: __u16,
    pub reserved: __u16,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[test]
fn bindgen_test_layout_ib_uverbs_attach_mcast() {
    assert_eq!(
        ::std::mem::size_of::<ib_uverbs_attach_mcast>(),
        24usize,
        concat!("Size of: ", stringify!(ib_uverbs_attach_mcast))
    );
    assert_eq!(
        ::std::mem::align_of::<ib_uverbs_attach_mcast>(),
        8usize,
        concat!("Alignment of ", stringify!(ib_uverbs_attach_mcast))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_attach_mcast>())).gid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_attach_mcast),
            "::",
            stringify!(gid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_attach_mcast>())).qp_handle as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_attach_mcast),
            "::",
            stringify!(qp_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_attach_mcast>())).mlid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_attach_mcast),
            "::",
            stringify!(mlid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ib_uverbs_attach_mcast>())).reserved as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(ib_uverbs_attach_mcast),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ib_uverbs_attach_mcast>())).driver_data as *const _ as usize
        },
