/* automatically generated by rust-bindgen */

pub const PCI_PATH_PROC_BUS_PCI: &'static [u8; 14usize] = b"/proc/bus/pci\0";
pub const PCI_PATH_SYS_BUS_PCI: &'static [u8; 13usize] = b"/sys/bus/pci\0";
pub const PCI_IDS: &'static [u8; 11usize] = b"pci.ids.gz\0";
pub const PCI_PATH_IDS_DIR: &'static [u8; 16usize] = b"/usr/share/misc\0";
pub const PCI_ID_DOMAIN: &'static [u8; 14usize] = b"pci.id.ucw.cz\0";
pub const PCILIB_VERSION: &'static [u8; 6usize] = b"3.7.0\0";
pub const PCI_VENDOR_ID: u32 = 0;
pub const PCI_DEVICE_ID: u32 = 2;
pub const PCI_COMMAND: u32 = 4;
pub const PCI_COMMAND_IO: u32 = 1;
pub const PCI_COMMAND_MEMORY: u32 = 2;
pub const PCI_COMMAND_MASTER: u32 = 4;
pub const PCI_COMMAND_SPECIAL: u32 = 8;
pub const PCI_COMMAND_INVALIDATE: u32 = 16;
pub const PCI_COMMAND_VGA_PALETTE: u32 = 32;
pub const PCI_COMMAND_PARITY: u32 = 64;
pub const PCI_COMMAND_WAIT: u32 = 128;
pub const PCI_COMMAND_SERR: u32 = 256;
pub const PCI_COMMAND_FAST_BACK: u32 = 512;
pub const PCI_COMMAND_DISABLE_INTx: u32 = 1024;
pub const PCI_STATUS: u32 = 6;
pub const PCI_STATUS_INTx: u32 = 8;
pub const PCI_STATUS_CAP_LIST: u32 = 16;
pub const PCI_STATUS_66MHZ: u32 = 32;
pub const PCI_STATUS_UDF: u32 = 64;
pub const PCI_STATUS_FAST_BACK: u32 = 128;
pub const PCI_STATUS_PARITY: u32 = 256;
pub const PCI_STATUS_DEVSEL_MASK: u32 = 1536;
pub const PCI_STATUS_DEVSEL_FAST: u32 = 0;
pub const PCI_STATUS_DEVSEL_MEDIUM: u32 = 512;
pub const PCI_STATUS_DEVSEL_SLOW: u32 = 1024;

pub const SCNxMAX: &'static [u8; 3usize] = b"lx\0";
pub const SCNdPTR: &'static [u8; 3usize] = b"ld\0";
pub const SCNiPTR: &'static [u8; 3usize] = b"li\0";
pub const SCNoPTR: &'static [u8; 3usize] = b"lo\0";
pub const SCNuPTR: &'static [u8; 3usize] = b"lu\0";
pub const SCNxPTR: &'static [u8; 3usize] = b"lx\0";
pub const PCI_U64_FMT_X: &'static [u8; 3usize] = b"lx\0";
pub const PCIADDR_T_FMT: &'static [u8; 6usize] = b"%08lx\0";
pub const PCIADDR_PORT_FMT: &'static [u8; 6usize] = b"%04lx\0";
pub const PCIIRQ_FMT: &'static [u8; 3usize] = b"%d\0";
pub const PCI_LIB_VERSION: u32 = 198400;
pub const PCI_ADDR_FLAG_MASK: u32 = 15;
pub const PCI_FILL_IDENT: u32 = 1;
pub const PCI_FILL_IRQ: u32 = 2;
pub const PCI_FILL_BASES: u32 = 4;
pub const PCI_FILL_ROM_BASE: u32 = 8;
pub const PCI_FILL_SIZES: u32 = 16;
pub const PCI_FILL_CLASS: u32 = 32;
pub const PCI_FILL_CAPS: u32 = 64;
pub const PCI_FILL_EXT_CAPS: u32 = 128;
pub const PCI_FILL_PHYS_SLOT: u32 = 256;
pub const PCI_FILL_MODULE_ALIAS: u32 = 512;
pub const PCI_FILL_LABEL: u32 = 1024;
pub const PCI_FILL_NUMA_NODE: u32 = 2048;
pub const PCI_FILL_IO_FLAGS: u32 = 4096;
pub const PCI_FILL_DT_NODE: u32 = 8192;
pub const PCI_FILL_IOMMU_GROUP: u32 = 16384;
pub const PCI_FILL_RESCAN: u32 = 65536;
pub const PCI_CAP_NORMAL: u32 = 1;
pub const PCI_CAP_EXTENDED: u32 = 2;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type ssize_t = __ssize_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type size_t = ::std::os::raw::c_ulong;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__atomic_wide_counter__bindgen_ty_1>())).__low as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__atomic_wide_counter__bindgen_ty_1>())).__high as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__atomic_wide_counter>())).__value64 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__atomic_wide_counter>())).__value32 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wseq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_start as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__once_flag>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type pciaddr_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pci_methods {
    _unused: [u8; 0],
}
pub const pci_access_type_PCI_ACCESS_AUTO: pci_access_type = 0;
pub const pci_access_type_PCI_ACCESS_SYS_BUS_PCI: pci_access_type = 1;
pub const pci_access_type_PCI_ACCESS_PROC_BUS_PCI: pci_access_type = 2;
pub const pci_access_type_PCI_ACCESS_I386_TYPE1: pci_access_type = 3;
pub const pci_access_type_PCI_ACCESS_I386_TYPE2: pci_access_type = 4;
pub const pci_access_type_PCI_ACCESS_FBSD_DEVICE: pci_access_type = 5;
pub const pci_access_type_PCI_ACCESS_AIX_DEVICE: pci_access_type = 6;
pub const pci_access_type_PCI_ACCESS_NBSD_LIBPCI: pci_access_type = 7;
pub const pci_access_type_PCI_ACCESS_OBSD_DEVICE: pci_access_type = 8;
pub const pci_access_type_PCI_ACCESS_DUMP: pci_access_type = 9;
pub const pci_access_type_PCI_ACCESS_DARWIN: pci_access_type = 10;
pub const pci_access_type_PCI_ACCESS_SYLIXOS_DEVICE: pci_access_type = 11;
pub const pci_access_type_PCI_ACCESS_HURD: pci_access_type = 12;
pub const pci_access_type_PCI_ACCESS_MAX: pci_access_type = 13;
pub type pci_access_type = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pci_access {
    pub method: ::std::os::raw::c_uint,
    pub writeable: ::std::os::raw::c_int,
    pub buscentric: ::std::os::raw::c_int,
    pub id_file_name: *mut ::std::os::raw::c_char,
    pub free_id_name: ::std::os::raw::c_int,
    pub numeric_ids: ::std::os::raw::c_int,
    pub id_lookup_mode: ::std::os::raw::c_uint,
    pub debugging: ::std::os::raw::c_int,
    pub error: ::std::option::Option<unsafe extern "C" fn(msg: *mut ::std::os::raw::c_char, ...)>,
    pub warning: ::std::option::Option<unsafe extern "C" fn(msg: *mut ::std::os::raw::c_char, ...)>,
    pub debug: ::std::option::Option<unsafe extern "C" fn(msg: *mut ::std::os::raw::c_char, ...)>,
    pub devices: *mut pci_dev,
    pub methods: *mut pci_methods,
    pub params: *mut pci_param,
    pub id_hash: *mut *mut id_entry,
    pub current_id_bucket: *mut id_bucket,
    pub id_load_failed: ::std::os::raw::c_int,
    pub id_cache_status: ::std::os::raw::c_int,
    pub id_udev: *mut udev,
    pub id_udev_hwdb: *mut udev_hwdb,
    pub fd: ::std::os::raw::c_int,
    pub fd_rw: ::std::os::raw::c_int,
    pub fd_pos: ::std::os::raw::c_int,
    pub fd_vpd: ::std::os::raw::c_int,
    pub cached_dev: *mut pci_dev,
}
#[test]
fn bindgen_test_layout_pci_access() {
    assert_eq!(
        ::std::mem::size_of::<pci_access>(),
        152usize,
        concat!("Size of: ", stringify!(pci_access))
    );
    assert_eq!(
        ::std::mem::align_of::<pci_access>(),
        8usize,
        concat!("Alignment of ", stringify!(pci_access))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).method as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(method)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).writeable as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(writeable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).buscentric as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(buscentric)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).id_file_name as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(id_file_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).free_id_name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(free_id_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).numeric_ids as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(numeric_ids)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).id_lookup_mode as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(id_lookup_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).debugging as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(debugging)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).error as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).warning as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(warning)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).debug as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).devices as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(devices)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).methods as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(methods)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).params as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(params)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).id_hash as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(id_hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).current_id_bucket as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(current_id_bucket)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).id_load_failed as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(id_load_failed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).id_cache_status as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(id_cache_status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).id_udev as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(id_udev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).id_udev_hwdb as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(id_udev_hwdb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).fd as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).fd_rw as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(fd_rw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).fd_pos as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(fd_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).fd_vpd as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(fd_vpd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_access>())).cached_dev as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_access),
            "::",
            stringify!(cached_dev)
        )
    );
}
extern "C" {
    pub fn pci_alloc() -> *mut pci_access;
}
extern "C" {
    pub fn pci_init(arg1: *mut pci_access);
}
extern "C" {
    pub fn pci_cleanup(arg1: *mut pci_access);
}
extern "C" {
    pub fn pci_scan_bus(acc: *mut pci_access);
}
extern "C" {
    pub fn pci_get_dev(
        acc: *mut pci_access,
        domain: ::std::os::raw::c_int,
        bus: ::std::os::raw::c_int,
        dev: ::std::os::raw::c_int,
        func: ::std::os::raw::c_int,
    ) -> *mut pci_dev;
}
extern "C" {
    pub fn pci_free_dev(arg1: *mut pci_dev);
}
extern "C" {
    pub fn pci_lookup_method(name: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pci_get_method_name(index: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pci_param {
    pub next: *mut pci_param,
    pub param: *mut ::std::os::raw::c_char,
    pub value: *mut ::std::os::raw::c_char,
    pub value_malloced: ::std::os::raw::c_int,
    pub help: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_pci_param() {
    assert_eq!(
        ::std::mem::size_of::<pci_param>(),
        40usize,
        concat!("Size of: ", stringify!(pci_param))
    );
    assert_eq!(
        ::std::mem::align_of::<pci_param>(),
        8usize,
        concat!("Alignment of ", stringify!(pci_param))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_param>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_param),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_param>())).param as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_param),
            "::",
            stringify!(param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_param>())).value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_param),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_param>())).value_malloced as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_param),
            "::",
            stringify!(value_malloced)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_param>())).help as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_param),
            "::",
            stringify!(help)
        )
    );
}
extern "C" {
    pub fn pci_get_param(
        acc: *mut pci_access,
        param: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn pci_set_param(
        acc: *mut pci_access,
        param: *mut ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pci_walk_params(acc: *mut pci_access, prev: *mut pci_param) -> *mut pci_param;
}
#[repr(C)]
pub struct pci_dev {
    pub next: *mut pci_dev,
    pub domain_16: u16,
    pub bus: u8,
    pub dev: u8,
    pub func: u8,
    pub known_fields: ::std::os::raw::c_uint,
    pub vendor_id: u16,
    pub device_id: u16,
    pub device_class: u16,
    pub irq: ::std::os::raw::c_int,
    pub base_addr: [pciaddr_t; 6usize],
    pub size: [pciaddr_t; 6usize],
    pub rom_base_addr: pciaddr_t,
    pub rom_size: pciaddr_t,
    pub first_cap: *mut pci_cap,
    pub phy_slot: *mut ::std::os::raw::c_char,
    pub module_alias: *mut ::std::os::raw::c_char,
    pub label: *mut ::std::os::raw::c_char,
    pub numa_node: ::std::os::raw::c_int,
    pub flags: [pciaddr_t; 6usize],
    pub rom_flags: pciaddr_t,
    pub domain: ::std::os::raw::c_int,
    pub access: *mut pci_access,
    pub methods: *mut pci_methods,
    pub cache: *mut u8,
    pub cache_len: ::std::os::raw::c_int,
    pub hdrtype: ::std::os::raw::c_int,
    pub aux: *mut ::std::os::raw::c_void,
    pub properties: *mut pci_property,
    pub last_cap: *mut pci_cap,
}
#[test]
fn bindgen_test_layout_pci_dev() {
    assert_eq!(
        ::std::mem::size_of::<pci_dev>(),
        304usize,
        concat!("Size of: ", stringify!(pci_dev))
    );
    assert_eq!(
        ::std::mem::align_of::<pci_dev>(),
        8usize,
        concat!("Alignment of ", stringify!(pci_dev))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).domain_16 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(domain_16)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).bus as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(bus)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).dev as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).func as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).known_fields as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(known_fields)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).vendor_id as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(vendor_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).device_id as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(device_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).device_class as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(device_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).irq as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(irq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).base_addr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(base_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).size as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).rom_base_addr as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(rom_base_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).rom_size as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(rom_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).first_cap as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(first_cap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).phy_slot as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(phy_slot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).module_alias as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(module_alias)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).label as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).numa_node as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(numa_node)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).flags as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).rom_flags as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(rom_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).domain as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(domain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).access as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(access)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).methods as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(methods)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).cache as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(cache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).cache_len as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(cache_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).hdrtype as *const _ as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(hdrtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).aux as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(aux)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).properties as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(properties)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_dev>())).last_cap as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_dev),
            "::",
            stringify!(last_cap)
        )
    );
}
extern "C" {
    pub fn pci_read_byte(arg1: *mut pci_dev, pos: ::std::os::raw::c_int) -> u8;
}
extern "C" {
    pub fn pci_read_word(arg1: *mut pci_dev, pos: ::std::os::raw::c_int) -> u16;
}
extern "C" {
    pub fn pci_read_long(arg1: *mut pci_dev, pos: ::std::os::raw::c_int) -> u32;
}
extern "C" {
    pub fn pci_read_block(
        arg1: *mut pci_dev,
        pos: ::std::os::raw::c_int,
        buf: *mut u8,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pci_read_vpd(
        d: *mut pci_dev,
        pos: ::std::os::raw::c_int,
        buf: *mut u8,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pci_write_byte(
        arg1: *mut pci_dev,
        pos: ::std::os::raw::c_int,
        data: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pci_write_word(
        arg1: *mut pci_dev,
        pos: ::std::os::raw::c_int,
        data: u16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pci_write_long(
        arg1: *mut pci_dev,
        pos: ::std::os::raw::c_int,
        data: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pci_write_block(
        arg1: *mut pci_dev,
        pos: ::std::os::raw::c_int,
        buf: *mut u8,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pci_fill_info(arg1: *mut pci_dev, flags: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pci_get_string_property(d: *mut pci_dev, prop: u32) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn pci_setup_cache(arg1: *mut pci_dev, cache: *mut u8, len: ::std::os::raw::c_int);
}
#[repr(C)]
pub struct pci_cap {
    pub next: *mut pci_cap,
    pub id: u16,
    pub type_: u16,
    pub addr: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pci_cap() {
    assert_eq!(
        ::std::mem::size_of::<pci_cap>(),
        16usize,
        concat!("Size of: ", stringify!(pci_cap))
    );
    assert_eq!(
        ::std::mem::align_of::<pci_cap>(),
        8usize,
        concat!("Alignment of ", stringify!(pci_cap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_cap>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_cap),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_cap>())).id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_cap),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_cap>())).type_ as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_cap),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_cap>())).addr as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_cap),
            "::",
            stringify!(addr)
        )
    );
}
extern "C" {
    pub fn pci_find_cap(
        arg1: *mut pci_dev,
        id: ::std::os::raw::c_uint,
        type_: ::std::os::raw::c_uint,
    ) -> *mut pci_cap;
}
extern "C" {
    pub fn pci_find_cap_nr(
        arg1: *mut pci_dev,
        id: ::std::os::raw::c_uint,
        type_: ::std::os::raw::c_uint,
        cap_number: *mut ::std::os::raw::c_uint,
    ) -> *mut pci_cap;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pci_filter {
    pub domain: ::std::os::raw::c_int,
    pub bus: ::std::os::raw::c_int,
    pub slot: ::std::os::raw::c_int,
    pub func: ::std::os::raw::c_int,
    pub vendor: ::std::os::raw::c_int,
    pub device: ::std::os::raw::c_int,
    pub device_class: ::std::os::raw::c_int,
    pub rfu: [::std::os::raw::c_int; 3usize],
}
#[test]
fn bindgen_test_layout_pci_filter() {
    assert_eq!(
        ::std::mem::size_of::<pci_filter>(),
        40usize,
        concat!("Size of: ", stringify!(pci_filter))
    );
    assert_eq!(
        ::std::mem::align_of::<pci_filter>(),
        4usize,
        concat!("Alignment of ", stringify!(pci_filter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_filter>())).domain as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_filter),
            "::",
            stringify!(domain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_filter>())).bus as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_filter),
            "::",
            stringify!(bus)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_filter>())).slot as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_filter),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_filter>())).func as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_filter),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_filter>())).vendor as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_filter),
            "::",
            stringify!(vendor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_filter>())).device as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_filter),
            "::",
            stringify!(device)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_filter>())).device_class as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_filter),
            "::",
            stringify!(device_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pci_filter>())).rfu as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pci_filter),
            "::",
            stringify!(rfu)
        )
    );
}
extern "C" {
    pub fn pci_filter_init(arg1: *mut pci_access, arg2: *mut pci_filter);
}
extern "C" {
    pub fn pci_filter_parse_slot(
        arg1: *mut pci_filter,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn pci_filter_parse_id(
        arg1: *mut pci_filter,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn pci_filter_match(arg1: *mut pci_filter, arg2: *mut pci_dev) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pci_lookup_name(
        a: *mut pci_access,
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        ...
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn pci_load_name_list(a: *mut pci_access) -> ::std::os::raw::c_int;
}
extern "C" {
